In [ ]:
%pip install pandas

In [ ]:
import pandas as pd

In [ ]:
import numpy as np

### Series

In [ ]:
data = [1,2,3,4,5]

series = pd.Series(data)
print(series)

In [ ]:
data1 = {'a':1, 'b':2, 'c':3}
series_dict = pd.Series(data1)
print(series_dict)
print(type(series_dict))

In [ ]:
data2 = [10,20,30]

index1 = ['a','b','c']

series_custom = pd.Series(data2, index=index1)

print(series_custom)

### DataFrame

In [ ]:
data = {
    'name': ['krish','kevin','jack'],
    'age': [25, 30, 45],
    'city':['bangalore','new york','florida']
}

df = pd.DataFrame(data)
print(df)

In [ ]:
data = [
    {"name":"Thameem",'age':20,'place':'India'},
    {"name":"kevin",'age':25,'place':'Uk'},
    {"name":"anvar",'age':30,'place':'India'},
    {"name":"peter",'age':18,'place':'Spain'}
]

dt = pd.DataFrame(data)
print(dt)

## Reading Data from CSV file

In [ ]:
df = pd.read_csv("sales_data.csv")
print(df.head())

## Accessing Data in DataFrame

In [ ]:
df['Region']

In [ ]:
df.loc[0]

In [ ]:
df.loc[1]

In [ ]:
df.iloc[0,0]

In [ ]:
df.iloc[1,2]

In [ ]:
df.at[1, 'Region']

In [ ]:
df.at[2, 'Item Type']

In [ ]:
df.iat[2, 2]

In [ ]:
df.iat[2, 3]

## Data Manipulatio with DataFrame

In [ ]:
df['Unit Price']

In [ ]:
dt

In [ ]:
dt['projects'] = [58, 77, 22, 14]

print(dt)

In [ ]:
dt.drop('projects', axis=1, inplace=True)
print(dt)

In [ ]:
dt['age'] = dt['age'] + 1
dt

In [ ]:
dt.drop(3, inplace=True)
print(dt)

## DataFrame attributes and methods

In [ ]:
print(dt.head())
print(dt.dtypes)
print(dt.describe())

# Sample Data

In [ ]:
df = pd.DataFrame({
    'Student_ID': [101, 102, 103, 104, 105, 106, 107, 108, 109, 110],
    'Name': ['Emma', 'Liam', 'Olivia', 'Noah', 'Ava', 'Mia', 'Ethan', 'Sophia', 'James', 'Isabella'],
    'Gender': ['F', 'M', 'F', 'M', 'F', 'F', 'M', 'F', 'M', 'F'],
    'Branch': ['CSE', 'CSE', 'ECE', 'ECE', 'ME', 'CSE', 'ME', 'ECE', 'CSE', 'CSE'],
    'City': ['Delhi', 'Mumbai', 'Delhi', 'Pune', 'Chennai', 'Hyderabad', 'Pune', 'Bangalore', 'Delhi', 'Chennai'],
    'Score': [88, 76, 92, 65, 70, 95, 58, 81, 73, 90],
    'Attendance (%)': [90, 85, 80, 75, 88, 70, 60, 92, 89, 78],
    'Skill Rating (1-10)': [9, 7, 8, 5, 6, 10, 4, 9, 7, 8],
    'Projects Completed': [12, 8, 10, 5, 7, 15, 3, 11, 9, 13],
    'Email': [
        'emma@gmail.com', 'liam@gmail.com', 'olivia@yahoo.com', 'noah@outlook.com', 
        'ava@gmail.com', 'mia@gmail.com', 'ethan@yahoo.com', 'sophia@gmail.com',
        'james@outlook.com', 'isabella@gmail.com'
    ]
})

In [ ]:
df

### Updating & Replacing

In [ ]:
# updating single cell
df.loc[1] # students Liam
df.loc[1, 'City'] = 'Pune'
af = df.rename(columns={'Attendance (%)':'Attendance'})
af

In [ ]:
# using iloc
df.iloc[3, 3]='CSE' # changed branch of student Noah with index 3 from ECE to CSE
df

In [ ]:
# Updating Multiple Column at once
df['Score'] = df['Score'] + 1
df

In [ ]:
# Add a column based on another column

df['Result'] = df['Score'].apply(lambda x: 'Pass' if x>= 70 else 'Fail')  
df

### Deleting & Cleaning & Null Handling

In [ ]:
# Deleting a specific content
df = df.drop(9, axis=0)

In [131]:
df.loc[df['Name'] =='Emma', 'Score'] = np.nan
df.loc[df['Student_ID'] ==108, 'Attendance'] = np.nan
df.loc[df['Student_ID'] ==103, 'Branch'] = np.nan

In [123]:
df

,Student_ID,Name,Gender,Branch,City,Score,Attendance,Skill Rating (1-10),Projects Completed,Email,Result
6,107,Ethan,M,ME,Pune,61.0,60.0,4,3,ethan@yahoo.com,Fail
3,104,Noah,M,CSE,Pune,68.0,75.0,5,5,noah@outlook.com,Fail
4,105,Ava,F,ME,Chennai,73.0,88.0,6,7,ava@gmail.com,Pass
8,109,James,M,CSE,Delhi,76.0,89.0,7,9,james@outlook.com,Pass
0,101,Emma,F,CSE,Delhi,NaN,90.0,9,12,emma@gmail.com,Pass
1,102,Liam,M,CSE,Pune,79.0,85.0,7,8,liam@gmail.com,Pass
7,108,Sophia,F,ECE,Bangalore,84.0,NaN,9,11,sophia@gmail.com,Pass
2,103,Olivia,F,NaN,Delhi,95.0,80.0,8,10,olivia@yahoo.com,Pass
5,106,Mia,F,CSE,Hyderabad,98.0,70.0,10,15,mia@gmail.com,Pass

In [ ]:
# Filling NaN Values with zero clean the data
df['Score'] =df['Score'].fillna(0)
df['Score']

df.loc[df['Student_ID']==103,'Branch']='ME'
df

In [124]:
# Filling all the NaN value with 0 any

df = df.fillna(0)

In [ ]:
# changing the original DataFrame directly , so no need of df = df.fillna
# df.fillna(0, inplace=True)

df.fillna(0, inplace=True)

### Filling NaN values based on mean / median / mode

In [ ]:
mean_score = df['Attendance'].mean()
df['Attendance'] = df['Attendance'].fillna(mean_score)

In [ ]:
df

In [ ]:
df['Score'].fillna(df['Score'].mean())

In [ ]:
# filling NaN with median 
df['Score'].fillna(df['Score'].median())

In [ ]:
# Filling NaN with most frequent value (mode)

df['Attendance'] = df['Attendance'].fillna(df['Attendance'].mode())
df

In [ ]:
df['Branch'] = df['Branch'].fillna(df['Branch'].mode()[0])
df

In [ ]:
# Fill NaN Forward or Backward ;

# Forward Fill (copy previous value) -> ffill
df['Attendance'] = df['Attendance'].fillna(method='ffill')
df

In [ ]:
# Backward Fill (copy next value) -> bfill
df['Score'] = df['Score'].fillna(method='bfill')
df

In [ ]:
#  Replace Text Missing Values as NaN â†’ Then Fill
df.replace(['NA', 'N/A', 'missing', '--'], np.nan, inplace=True)

#  then filling the NaN VALUES
df['Score'] = df['Score'].fillna('not_provided')

### Sorting & Filtering

### Sorting

In [ ]:
# sort by single column
df.sort_values(by='Score')
df.sort_values(by='Score', ascending=False) # heighest to lowest

In [ ]:
# sort by multiple column
df.sort_values(by=['Score', 'Attendance'], ascending=[False, True])

In [ ]:
# sort index and sorting columns
df.sort_index(ascending=False)

In [ ]:
# Sort columns

df.sort_index(axis=1)

In [ ]:
# In place sorting

df.sort_values(by='Score', inplace=True)

In [ ]:
df.sort_values(by='Score', na_position='first')
df.sort_values(by='Score', na_position='last')

,Student_ID,Name,Gender,Branch,City,Score,Attendance,Skill Rating (1-10),Projects Completed,Email,Result
0,101,Emma,F,CSE,Delhi,NaN,90.0,9,12,emma@gmail.com,Pass
6,107,Ethan,M,ME,Pune,61.0,60.0,4,3,ethan@yahoo.com,Fail
3,104,Noah,M,CSE,Pune,68.0,75.0,5,5,noah@outlook.com,Fail
4,105,Ava,F,ME,Chennai,73.0,88.0,6,7,ava@gmail.com,Pass
8,109,James,M,CSE,Delhi,76.0,89.0,7,9,james@outlook.com,Pass
1,102,Liam,M,CSE,Pune,79.0,85.0,7,8,liam@gmail.com,Pass
7,108,Sophia,F,ECE,Bangalore,84.0,NaN,9,11,sophia@gmail.com,Pass
2,103,Olivia,F,NaN,Delhi,95.0,80.0,8,10,olivia@yahoo.com,Pass
5,106,Mia,F,CSE,Hyderabad,98.0,70.0,10,15,mia@gmail.com,Pass

In [ ]:
df

,Student_ID,Name,Gender,Branch,City,Score,Attendance,Skill Rating (1-10),Projects Completed,Email,Result
6,107,Ethan,M,ME,Pune,61.0,60.0,4,3,ethan@yahoo.com,Fail
3,104,Noah,M,CSE,Pune,68.0,75.0,5,5,noah@outlook.com,Fail
4,105,Ava,F,ME,Chennai,73.0,88.0,6,7,ava@gmail.com,Pass
8,109,James,M,CSE,Delhi,76.0,89.0,7,9,james@outlook.com,Pass
0,101,Emma,F,CSE,Delhi,0.0,90.0,9,12,emma@gmail.com,Pass
1,102,Liam,M,CSE,Pune,79.0,85.0,7,8,liam@gmail.com,Pass
7,108,Sophia,F,ECE,Bangalore,84.0,0.0,9,11,sophia@gmail.com,Pass
2,103,Olivia,F,0,Delhi,95.0,80.0,8,10,olivia@yahoo.com,Pass
5,106,Mia,F,CSE,Hyderabad,98.0,70.0,10,15,mia@gmail.com,Pass

In [134]:
# Sort with Custom Key

df.sort_values(by='Name', key=lambda x: x.str.lower())

,Student_ID,Name,Gender,Branch,City,Score,Attendance,Skill Rating (1-10),Projects Completed,Email,Result
4,105,Ava,F,ME,Chennai,73.0,88.0,6,7,ava@gmail.com,Pass
0,101,Emma,F,CSE,Delhi,NaN,90.0,9,12,emma@gmail.com,Pass
6,107,Ethan,M,ME,Pune,61.0,60.0,4,3,ethan@yahoo.com,Fail
8,109,James,M,CSE,Delhi,76.0,89.0,7,9,james@outlook.com,Pass
1,102,Liam,M,CSE,Pune,79.0,85.0,7,8,liam@gmail.com,Pass
5,106,Mia,F,CSE,Hyderabad,98.0,70.0,10,15,mia@gmail.com,Pass
3,104,Noah,M,CSE,Pune,68.0,75.0,5,5,noah@outlook.com,Fail
2,103,Olivia,F,NaN,Delhi,95.0,80.0,8,10,olivia@yahoo.com,Pass
7,108,Sophia,F,ECE,Bangalore,84.0,NaN,9,11,sophia@gmail.com,Pass

In [138]:
df.sort_values(by='Name', key=lambda x: x.str.len())

,Student_ID,Name,Gender,Branch,City,Score,Attendance,Skill Rating (1-10),Projects Completed,Email,Result
4,105,Ava,F,ME,Chennai,73.0,88.0,6,7,ava@gmail.com,Pass
5,106,Mia,F,CSE,Hyderabad,98.0,70.0,10,15,mia@gmail.com,Pass
3,104,Noah,M,CSE,Pune,68.0,75.0,5,5,noah@outlook.com,Fail
0,101,Emma,F,CSE,Delhi,NaN,90.0,9,12,emma@gmail.com,Pass
1,102,Liam,M,CSE,Pune,79.0,85.0,7,8,liam@gmail.com,Pass
6,107,Ethan,M,ME,Pune,61.0,60.0,4,3,ethan@yahoo.com,Fail
8,109,James,M,CSE,Delhi,76.0,89.0,7,9,james@outlook.com,Pass
7,108,Sophia,F,ECE,Bangalore,84.0,NaN,9,11,sophia@gmail.com,Pass
2,103,Olivia,F,NaN,Delhi,95.0,80.0,8,10,olivia@yahoo.com,Pass

### Grouping & Aggregate

### concatenation & combining dataframes